app/controllers/student_score_controller.rb

SELECT "scores".* FROM "scores" WHERE "scores"."student_id" = ? ORDER BY "scores"."id" ASC LIMIT ?  [["student_id", 1], ["LIMIT", 1]]
---
    def home
        @studentID = params[:id].to_i
        @scores = Score.where(student_id: @studentID)

DELETE FROM "scores" WHERE "scores"."id" = ?  [["id", 2]]
---
    def delete
        Score.destroy_by(id: params[:id])